cases/carrier_template/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        name            top;
        patchInfo
        {
            type            patch;
        }
        constructFrom set;
        set top;
    }
    {
        name            left;
        patchInfo
        {
            type            patch;
        }
        constructFrom set;
        set left;
    }
    {
        name            right;
        patchInfo
        {
            type            patch;
        }
        constructFrom set;
        set right;
    }
    {
        name            back;
        patchInfo
        {
            type            patch;
        }
        constructFrom set;
        set back;
    }
    {
        name            front;
        patchInfo
        {
            type            patch;
        }
        constructFrom set;
        set front;
    }
);

// ************************************************************************* //
