cases/carrier_template/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
# Script to run the whole case from scratch
#------------------------------------------------------------------------------

rm -rf constant/polyMesh/sets

runApplication blockMesh
runApplication surfaceFeatureExtract

runApplication snappyHexMesh -overwrite

runApplication splitMeshRegions -cellZones -overwrite

rm -rf 0
cp -r 0.org 0

for region in $(foamListRegions solid)
do
    rm -f 0/$region/{nut,alphat,epsilon,k,U,p_rgh}
    rm -f processor*/0/$region/{nut,alphat,epsilon,k,U,p_rgh}
done

# change directonarys for 0 directionary and all regions 
for region in $(foamListRegions)
do
    runApplication -s $region changeDictionary -region $region
done

runApplication renumberMesh -overwrite


# Decompose
runApplication decomposePar -allRegions -constant

#------------------------------------------------------------------------------
